app/controllers/posts_controller.rb

  def index
    @query = params[:query].to_s.strip
    @pagination = Pagination.new(Post.search(@query).newest_first.includes(:user), page: params[:page])
---
SELECT "posts".* FROM "posts"

  def create
    @post = Current.user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Rolt"], ["body", "dsh"], ["created_at", "2024-11-22 07:35:20.589232"], ["updated_at", "2024-11-22 07:35:20.589232"]]

  def destroy
    @post.destroy!
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]

    def set_post
      @post = Post.find(params.expect(:id))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]